12-batteries.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Project: batteries.js</title>
<!-- 2021-04-14 Wed 16:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="highlight/styles/vs2015.css">
</head>
<body>
<div id="content">
<h1 class="title">Project: batteries.js</h1>
<p>
<b><a href="index.html">Home</a></b>
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Project: batteries.js</a>
<ul>
<li><a href="#sec-1-1">1.1. Description</a></li>
<li><a href="#sec-1-2">1.2. Functions</a></li>
<li><a href="#sec-1-3">1.3. Usage</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Project: batteries.js</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Description</h3>
<div class="outline-text-3" id="text-1-1">
<p>
When starting to code in a standard JavaScript environment, batteries are not included, so to speak. In this project, you will make the batteries so that the next projects are easier from the start. The goal is to create a module with many useful functions that can be used with future projects and code. The result should be a single file <code>batteries.js</code> that exports the following functions.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Functions</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Numbers</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>isEven
<ul class="org-ul">
<li>Arguments: <code>n</code> (number)
</li>
<li>Return: true if <code>n</code> is even, otherwise false
</li>
</ul>
</li>

<li>isOdd
<ul class="org-ul">
<li>Arguments: <code>n</code> (number)
</li>
<li>Return: true if <code>n</code> is odd, otherwise false
</li>
</ul>
</li>

<li>divisibleBy
<ul class="org-ul">
<li>Arguments: <code>x</code> (number), <code>y</code> (number)
</li>
<li>Return: true if <code>x</code> is divisible by <code>y</code>, otherwise false
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Arrays</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>append
<ul class="org-ul">
<li>Arguments: <code>y</code> (any), <code>xs</code> (array)
</li>
<li>Return: array with <code>y</code> appended to <code>xs</code>
</li>
</ul>
</li>

<li>eqArrays
<ul class="org-ul">
<li>Arguments: <code>xs</code> (array), <code>ys</code> (array)
</li>
<li>Return: true if <code>xs</code> and <code>ys</code> are the same length and all of their elements are equal, otherwise false
</li>
</ul>
</li>

<li>head
<ul class="org-ul">
<li>Arguments: <code>xs</code> (array)
</li>
<li>Return: the first element of <code>xs</code>
</li>
</ul>
</li>

<li>tail
<ul class="org-ul">
<li>Arguments: <code>xs</code> (array)
</li>
<li>Return: an array containing all of the elements of <code>xs</code> except the first one
</li>
</ul>
</li>

<li>last
<ul class="org-ul">
<li>Arguments: <code>xs</code> (array)
</li>
<li>Return: the last element of <code>xs</code>
</li>
</ul>
</li>

<li>init
<ul class="org-ul">
<li>Arguments: <code>xs</code> (array)
</li>
<li>Return: an array containing all of the elements of <code>xs</code> except the last one
</li>
</ul>
</li>

<li>isEmpty
<ul class="org-ul">
<li>Arguments: <code>xs</code> (array)
</li>
<li>Return: true if <code>xs</code> contains no elements, otherwise false
</li>
</ul>
</li>

<li>take
<ul class="org-ul">
<li>Arguments: <code>n</code> (number), <code>xs</code> (array)
</li>
<li>Return: an array containing the first <code>n</code> elements of <code>xs</code>
</li>
</ul>
</li>

<li>drop
<ul class="org-ul">
<li>Arguments: <code>n</code> (number), <code>xs</code> (array)
</li>
<li>Return: an array containing the elements of <code>xs</code> without the first <code>n</code> elements
</li>
</ul>
</li>

<li>flatten
<ul class="org-ul">
<li>Arguments: <code>xs</code> (array)
</li>
<li>Return: an array containing the elements of <code>xs</code> where any nested arrays have been pulled out (only needs to work with one level of nesting deep)
</li>
</ul>
</li>

<li>intersperse
<ul class="org-ul">
<li>Arguments: <code>sep</code> (any), <code>xs</code> (array)
</li>
<li>Return: an array containing the elements of <code>xs</code> with <code>sep</code> interspersed between the elements
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Number arrays</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>sum
<ul class="org-ul">
<li>Arguments: <code>ns</code> (array)
</li>
<li>Return: the sum of all numbers in <code>ns</code>
</li>
</ul>
</li>

<li>product
<ul class="org-ul">
<li>Arguments: <code>ns</code> (array)
</li>
<li>Return: the product of all numbers in <code>ns</code>
</li>
</ul>
</li>

<li>maximum
<ul class="org-ul">
<li>Arguments: <code>ns</code> (array)
</li>
<li>Return: the highest number in <code>ns</code>
</li>
</ul>
</li>

<li>minimum
<ul class="org-ul">
<li>Arguments: <code>ns</code> (array)
</li>
<li>Return: the lowest number in <code>ns</code>
</li>
</ul>
</li>

<li>range
<ul class="org-ul">
<li>Arguments: <code>start</code> (number), <code>end</code> (number)
</li>
<li>Return: an array of numbers counting up from <code>start</code> to <code>end</code> (inclusive)
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Objects</h4>
<div class="outline-text-4" id="text-1-2-4">
<ul class="org-ul">
<li>eqObjects
<ul class="org-ul">
<li>Arguments: <code>a</code> (object), <code>b</code> (object)
</li>
<li>Return: true if <code>a</code> and <code>b</code> have all the same values at all of their keys, otherwise false
</li>
</ul>
</li>

<li>setProp
<ul class="org-ul">
<li>Arguments: k (string), v (any), o (object)
</li>
<li>Return: an object containing the properties of <code>o</code> but with the value at <code>k</code> set to <code>v</code>
</li>
</ul>
</li>

<li>removeProp
<ul class="org-ul">
<li>Arguments: k (string), o (object)
</li>
<li>Return: an object containing the properties of <code>o</code> but with the value at <code>k</code> set to <code>undefined</code>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Usage</h3>
<div class="outline-text-3" id="text-1-3">
<p>
If everything is done correctly, you should be able to run the following example in a file that is in the same directory as <code>batteries.js</code>.
</p>

<div class="org-src-container">

<pre class="src src-js">const {sum, range} = require('./batteries');

console.log(sum(range(1, 5))); // should print 15
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
